Repository: osaurus-ai/osaurus
Catalog: Packages/OsaurusCore/Resources/Localizable.xcstrings
Source language: en
Languages: ko, ru, zh_hans, zh_hant

source: Peers granted access to this agent — usage and revocation.
ko: 이 에이전트에 대한 액세스 권한이 부여된 피어 — 사용량 및 권한 취소.
ru: Узлы, которым выдан доступ к этому агенту: использование и отзыв доступа.
zh_hans: 已获准访问此智能体的对等端——使用情况与撤销操作
zh_hant: 已獲準訪問此智能體的對等端——使用情況與撤銷操作

source: Peers granted access to this agent. Revoking takes effect immediately.
ko: 이 에이전트에 대한 액세스 권한이 부여된 피어입니다. 권한 취소는 즉시 적용됩니다.
ru: Пиры предоставили доступ к этому агенту. Отзыв вступает в силу немедленно.
zh_hans: 已获准访问此智能体的对等端。撤销操作将立即生效。
zh_hant: 已獲準訪問此智能體的對等端。撤銷操作將立即生效。

source: Peers you pair with — or who redeem an invite to this agent — show up here with their usage and a way to revoke access.
ko: 페어링하거나 이 에이전트에 대한 초대장을 사용한 피어가 사용량 및 액세스 취소 방법과 함께 여기에 표시됩니다.
ru: Пиры, с которыми вы работаете в паре или которые активировали промпт для этого агента, отображаются здесь с указанием их использования и способа отозвать доступ.
zh_hans: 与你配对的对等端，或者兑换了此智能体邀请的用户，会连同其使用情况及撤销访问权限的操作一起显示在此处。
zh_hant: 與你配對的對等端，或者兌換了此智能體邀請的用戶，會連同其使用情況及撤銷訪問權限的操作一起顯示在此處。

source: Pending
ko: 대기 중
ru: Ожидает
zh_hans: 待处理
zh_hant: 待處理

source: Pending distillation complete
ko: 대기 중인 증류 완료
ru: Ожидание завершения дистилляции
zh_hans: 待处理的提炼已完成
zh_hant: 待處理的提煉已完成

source: Pending invite · %@…
ko: 대기 중인 초대 · %@…
ru: Ожидается промпт · %@…
zh_hans: 待处理邀请 · %@…
zh_hant: 待邀請 · %@…

source: Pending signals
ko: 대기 중인 신호
ru: Ожидаемые сигналы
zh_hans: 待处理信号
zh_hant: 待處理信號

source: Per access key. Blocks excess requests with HTTP 429.
ko: 액세스 키당 적용됩니다. 초과 요청은 HTTP 429로 차단됩니다.
ru: По ключу доступа. Блокирует лишние запросы с помощью HTTP 429.
zh_hans: 按访问密钥限制。超额请求将被拦截，并返回 HTTP 429 状态码。
zh_hant: 按訪問密鑰限制。超額請求將被攔截，並返回 HTTP 429 狀態碼。

source: Per-Agent Memory
ko: 에이전트별 메모리
ru: Память каждого агента
zh_hans: 按智能体的记忆
zh_hant: 按智能體的記憶

source: PER-AGENT MEMORY
ko: 에이전트별 메모리
ru: ПАМЯТЬ ПО АГЕНТАМ
zh_hans: 按智能体的记忆
zh_hant: 按智能體的記憶

source: Per-app rules
ko: 앱별 규칙
ru: Правила для каждого приложения
zh_hans: 按应用规则
zh_hant: 按應用規則

source: Per-app rules, app allowlist, and cloud vision.
ko: 앱별 규칙, 앱 허용 목록 및 클라우드 비전입니다.
ru: Правила для отдельных приложений, белый список приложений и облачное видение.
zh_hans: 按应用划分的规则、应用允许列表和云端视觉。
zh_hant: 按應用規則、應用白名單和雲端視覺。

source: Per-domain network allowlists require the VM sandbox (macOS 26 or later). On this device sandbox network access is all-or-nothing — use the Sandbox Network toggle above.
ko: 도메인별 네트워크 허용 목록은 VM 샌드박스(macOS 26 이상)가 필요합니다. 이 기기에서는 샌드박스 네트워크 접근이 전부 아니면 전무입니다 — 위의 샌드박스 네트워크 토글을 사용하세요.
ru: Списки разрешённых доменов для сети требуют песочницы на основе ВМ (macOS 26 или новее). На этом устройстве сетевой доступ песочницы — всё или ничего; используйте переключатель сети песочницы выше.
zh_hans: 按域名的网络允许列表需要 VM 沙盒（macOS 26 或更高版本）。在此设备上，沙盒网络访问是全有或全无 — 请使用上方的沙盒网络开关。
zh_hant: 按網域的網路允許清單需要 VM 沙盒（macOS 26 或更新版本）。在此裝置上，沙盒網路存取是全有或全無 — 請使用上方的沙盒網路開關。

source: Per-Provider
ko: 제공사별
ru: Для каждого провайдера
zh_hans: 按提供商
zh_hant: 按提供商

source: Per-Session KV Cap (tokens)
ko: 세션별 KV 제한 (토큰)
ru: Ограничение KV за сессию (токены)
zh_hans: 每会话 KV 限制（Token 数）
zh_hant: 每會話KV限制（詞元數）

source: Per-Session Window (tokens)
ko: 세션별 창 (토큰)
ru: Сеансовое окно (токены)
zh_hans: 每会话窗口（tokens）
zh_hant: 每會話窗口（tokens）

source: Per-Session Window Cap
ko: 세션별 창 제한
ru: Ограничение окна для каждого сеанса
zh_hans: 每会话窗口上限
zh_hant: 每會話窗口上限

source: Perception stays on this Mac by default. If an agent uses a cloud model, you can let it send screenshots for the rare cases on-screen text isn't enough — but only after sensitive text is masked on-device first.
ko: 인식 기능은 기본적으로 이 Mac에 유지됩니다. 에이전트가 클라우드 모델을 사용하는 경우 화면 텍스트만으로는 부족한 드문 경우에 스크린샷을 전송하도록 허용할 수 있지만, 이 기기에서 민감한 텍스트가 먼저 마스킹된 후에만 가능합니다.
ru: По умолчанию Восприятие остается на этом Mac. Если агент использует облачную модель, вы можете разрешить ему отправлять снимки экрана в редких случаях, когда текста на экране недостаточно — но только после того, как конфиденциальный текст сначала замаскирован на устройстве.
zh_hans: 感知功能默认在本机运行。如果智能体使用云端模型，你可以允许其发送截图以处理屏幕文字不足的极少数情况——但前提是敏感文字已在本地完成屏蔽。
zh_hant: 感知功能默認在本機運行。如果智能體使用雲端模型，您可以允許其發送截圖以處理屏幕文字不足的極少數情況——但前提是敏感文字已在本地完成屏蔽。

source: Performance
ko: 성능
ru: Производительность
zh_hans: 性能
zh_hant: 性能

source: Permanently delete identity, pinned facts, episodes, and conversation history.
ko: ID, 고정된 사실, 에피소드 및 대화 기록을 영구적으로 삭제합니다.
ru: Безвозвратно удалите идентификация, закрепленные факты, эпизоды и историю разговоров.
zh_hans: 永久删除身份、固定事实、情景和对话历史。
zh_hant: 永久刪除身份、固定事實、情節和對話歷史。

source: Permission
ko: 권한
ru: Разрешение
zh_hans: 权限
zh_hant: 權限

source: permission policy is deny
ko: 권한 정책이 거부입니다
ru: политика разрешений: deny
zh_hans: 权限策略为拒绝
zh_hant: 權限策略被拒絕

source: Permission required
ko: 권한 필요
ru: Требуется разрешение
zh_hans: 需要权限
zh_hant: 需要權限

source: Permissions
ko: 권한
ru: Разрешения
zh_hans: 权限
zh_hant: 權限

source: Permit audio-bearing requests on capable models.
ko: 지원되는 모델에서 오디오가 포함된 요청을 허용합니다.
ru: Разрешить запросы аудиопередачи на соответствующих моделях.
zh_hans: 在支持的模型上允许携带音频的请求。
zh_hant: 在支持的模型上允許攜帶音頻的請求。

source: Permit video-bearing requests on capable models.
ko: 지원되는 모델에서 비디오가 포함된 요청을 허용합니다.
ru: Разрешить запросы на передачу видео на совместимых моделях.
zh_hans: 在支持的模型上允许携带视频的请求。
zh_hant: 在支持的視頻模型上允許攜帶視頻的請求。

source: Persisted today; runtime consumers for these fields are not yet implemented.
ko: 오늘 유지되었습니다. 이 필드의 런타임 소비자는 아직 구현되지 않았습니다.
ru: Сохраняется уже сейчас; runtime-потребители этих полей ещё не реализованы.
zh_hans: 目前仅做持久化；这些字段的运行时使用者尚未实现。
zh_hant: 今日已持久化；這些字段的運行時使用者尚未實現。

source: Persisted today; the cache coordinator does not yet consume these. Ships in a follow-up.
ko: 현재 저장되지만 캐시 코디네이터가 아직 이를 사용하지 않습니다. 후속 업데이트에 포함됩니다.
ru: Сохраняется уже сейчас; координатор кэша пока это не использует. Будет подключено в следующем обновлении.
zh_hans: 目前仅做持久化；缓存协调器尚未消费这些设置。将在后续版本提供。
zh_hant: 目前僅做持久化；緩存協調器尚未消費這些設置。將在後續版本提供。

source: Persona
ko: 페르소나
ru: Персона
zh_hans: 人物设定
zh_hant: 人物設定

source: Personality
ko: 성격
ru: Идентификация
zh_hans: 个性
zh_hant: 個性

source: Personality (default for all agents)
ko: 성격 (모든 에이전트의 기본값)
ru: Идентификация (по умолчанию для всех агентов)
zh_hans: 个性（所有智能体的默认值）
zh_hant: 個性（所有智能體的默認值）

source: Phone numbers
ko: 전화번호
ru: Номера телефонов
zh_hans: 电话号码
zh_hant: 電話號碼

source: Pick a brain
ko: 두뇌 선택
ru: Выберите модель
zh_hans: 挑选一个大脑
zh_hant: 挑選一個大腦

source: Pick a Cloud provider
ko: 클라우드 제공사 선택
ru: Выберите облачного провайдера
zh_hans: 挑选一个云提供商
zh_hant: 挑選一個雲提供商

source: Pick a color
ko: 색상 선택
ru: Выберите цвет
zh_hans: 选择一个颜色
zh_hant: 選擇一個顏色

source: Pick a folder for the .osaurus-agent bundle.
ko: .osaurus-agent 번들의 폴더를 선택하세요.
ru: Выберите папку для пакета.osaurus-агента.
zh_hans: 为 .osaurus-agent 捆绑包选择一个文件夹。
zh_hant: 爲 .osaurus-agent 捆綁包選擇一個文件夾。

source: Pick a folder to write the plaintext backup to. We'll re-prompt for rotation after the backup completes.
ko: 일반 텍스트 백업을 쓸 폴더를 선택하세요. 백업이 완료된 후 교체를 위해 다시 묻습니다.
ru: Выберите папку, в которую будет записана резервная копия в виде незашифрованного текста. После завершения резервного копирования мы повторно запросим ротацию.
zh_hans: 选择一个用于写入明文备份的文件夹。备份完成后，我们会再次提示进行轮换。
zh_hant: 選擇一個用於寫入明文備份的文件夾。備份完成後，我們會再次提示進行輪換。

source: Pick a Palette
ko: 팔레트 선택
ru: Выберите палитру
zh_hans: 选择调色板
zh_hant: 選擇調色板

source: Pick a provider to continue
ko: 계속하려면 제공사를 선택하세요
ru: Выберите провайдера, чтобы продолжить
zh_hans: 选择一个提供商继续
zh_hant: 選擇一個提供商繼續

source: Pick a random name
ko: 임의의 이름 선택
ru: Выберите случайное имя
zh_hans: 随机选择一个名字
zh_hant: 隨機選擇一個名字

source: Pick a role
ko: 역할 선택
ru: Выберите роль
zh_hans: 选择一个角色
zh_hant: 選擇一個角色

source: Pick a starter, name it, write a prompt
ko: 시작 항목을 선택하고, 이름을 지정하고, 프롬프트를 작성하세요
ru: Выберите стартер, назовите его, напишите промпт
zh_hans: 挑选一个起点，命名它，写一段提示词
zh_hant: 挑選一個起點，命名它，寫一段提示詞

source: Pick a starter, then make it yours. The preview updates as you choose an avatar, name, and role.
ko: 시작 항목을 선택한 다음 내 것으로 만드세요. 아바타, 이름 및 역할을 선택하면 미리보기가 업데이트됩니다.
ru: Выберите стартер и сделайте его своим. Предварительный просмотр обновляется по мере того, как вы выбираете аватар, имя и роль.
zh_hans: 挑选一个起点，然后打造你的专属。当你选择头像、名称和角色时，预览会随之更新。
zh_hant: 挑選一個起點，然後打造你的專屬。當你選擇頭像、名稱和角色時，預覽會隨之更新。

source: Pick a table to see its rows.
ko: 행을 보려면 테이블을 선택하세요.
ru: Выберите таблицу, чтобы просмотреть ее строки.
zh_hans: 选择一个表以查看其行。
zh_hant: 選擇一個表以查看其行。

source: Pick a view to preview its rows.
ko: 행을 미리 보려면 보기를 선택하세요.
ru: Выберите представление, чтобы просмотреть его строки.
zh_hans: 选择一个视图以预览其行。
zh_hant: 選擇一個視圖以預覽其行。

source: Pick an empty folder; the plaintext export will be written here.
ko: 빈 폴더를 선택하세요. 일반 텍스트 내보내기가 여기에 기록됩니다.
ru: Выберите пустую папку; экспорт незашифрованного текста будет записан здесь.
zh_hans: 选择一个空文件夹；明文导出内容将写入此处。
zh_hant: 選擇一個空文件夾；明文導出內容將寫入此處。

source: Pick chats to move into this project. They'll share its instructions, knowledge, and memory.
ko: 이 프로젝트로 옮길 채팅을 선택하세요. 프로젝트의 지침, 지식, 메모리를 공유합니다.
ru: Выберите чаты для переноса в этот проект. Они получат его инструкции, знания и память.
zh_hans: 选择要移入此项目的聊天。它们将共享项目的指令、知识和记忆。
zh_hant: 選擇要移入此專案的聊天。它們將共享專案的指令、知識和記憶。

source: Pick from the smallest set of tokens whose probabilities sum to P.
ko: 확률의 합이 P인 가장 작은 토큰 세트에서 선택합니다.
ru: Выберите из наименьшего набора токенов, сумма вероятностей которых равна P.
zh_hans: 从概率总和达到 P 的最小 Token 集合中进行选取。
zh_hant: 從概率總和達到 P 的最小 token 集合中進行選取。

source: Pick one or more above.
ko: 위에서 하나 이상을 선택하세요.
ru: Выберите один или несколько выше.
zh_hans: 在上方选择一个或多个。
zh_hant: 在上方選擇一個或多個。

source: Pick the brain that powers your dino — switch any time.
ko: 디노의 동력이 될 두뇌를 선택하세요 — 언제든지 전환할 수 있습니다.
ru: Выберите модель для своего динозавра. Переключиться можно в любой момент.
zh_hans: 挑选能为你的恐龙提供动力的大脑——随时可以切换。
zh_hant: 挑選能爲你的恐龍提供動力的大腦——隨時可以切換。

source: Pick what your dino can do
ko: 디노가 할 수 있는 일을 선택하세요
ru: Выберите, что умеет ваш динозавр
zh_hans: 选择你的小恐龙能做什么
zh_hant: 選擇你的小恐龍能做什麼

source: Pick when this agent should resume firing scheduled and self-scheduled runs. The optional reason is logged in the audit trail.
ko: 이 에이전트가 예약된 실행 및 자체 예약된 실행을 언제 다시 시작할지 선택하세요. 선택적 이유는 감사 추적에 기록됩니다.
ru: Выберите, когда этот агент должен возобновить запуск запланированных и самопланируемых запусков. Необязательная причина регистрируется в журнале аудита.
zh_hans: 选择此智能体何时应恢复触发计划运行和自我计划运行。可选的原因会记录在审计日志中。
zh_hant: 選擇此智能體何時應恢復觸發計劃運行和自我計劃運行。可選的原因會記錄在審計日誌中。

source: Pick which agents can search and read this collection. You can change this later in each agent's Features → Knowledge section.
ko: 이 컬렉션을 검색하고 읽을 수 있는 에이전트를 선택하세요. 나중에 각 에이전트의 기능 → 지식 섹션에서 변경할 수 있습니다.
ru: Выберите, какие агенты могут искать и читать эту коллекцию. Позже это можно изменить в разделе «Функции → Знания» каждого агента.
zh_hans: 选择哪些智能体可以搜索和读取此集合。稍后可在每个智能体的“特性 → 知识”部分中更改。
zh_hant: 選擇哪些智能體可以搜尋和讀取此集合。稍後可在每個智能體的「特性 → 知識」部分中變更。

source: Pick which tools and skills this agent can use
ko: 이 에이전트가 사용할 수 있는 도구와 스킬을 선택하세요
ru: Выберите, какие инструменты и навыки может использовать этот агент.
zh_hans: 选择此智能体可以使用的工具和技能
zh_hant: 選擇此智能體可以使用的工具和技能

source: Pick which tools and skills this agent can use.
ko: 이 에이전트가 사용할 수 있는 도구와 스킬을 선택하세요.
ru: Выберите, какие инструменты и навыки может использовать этот агент.
zh_hans: 选择此智能体可使用的工具和技能。
zh_hant: 選擇此智能體可使用的工具和技能。

source: Picked for your Mac
ko: 이 Mac에 맞는 추천
ru: Подобрано для вашего Mac
zh_hans: 为你的 Mac 精选
zh_hant: 爲您的 Mac 精選

source: Picking up where you left off.
ko: 중단된 부분부터 다시 시작합니다.
ru: Продолжаем с того места, где остановились.
zh_hans: 从你上次中断的地方继续。
zh_hant: 從你上次中斷的地方繼續。

source: Picks up quiet speech, waits longer for pauses
ko: 조용한 음성을 감지하고 일시 정지될 때까지 더 오래 기다립니다.
ru: Улавливает тихую речь и дольше ждёт паузы
zh_hans: 可捕捉较轻的语音，并等待更长停顿
zh_hant: 可捕捉較輕的語音，並等待更長停頓

source: Pin
ko: 고정
ru: Закрепить
zh_hans: 置顶
zh_hant: 置頂

source: Pin a saved view from the Views tab to make it appear here. Use this Home tab as the agent's at-a-glance dashboard.
ko: 여기에 표시되도록 '보기' 탭에서 저장된 보기를 고정하세요. 이 '홈' 탭을 에이전트의 한눈에 보기 대시보드로 사용하세요.
ru: Закрепите сохранённое представление на вкладке «Представления», чтобы оно появилось здесь. Используйте вкладку «Главная» в качестве наглядной информационной панели агента.
zh_hans: 从“视图”标签页置顶一个已保存的视图，使其显示在此处。可将此“主页”标签页用作智能体的一览式仪表板。
zh_hant: 從「視圖」標籤頁置頂一個已保存的視圖，使其顯示在此處。可將此「主頁」標籤頁用作智能體的一覽式儀錶板。

source: Pin to Home
ko: 홈에 고정
ru: Закрепить на главной странице
zh_hans: 置顶到主页
zh_hant: 置頂到主頁

source: Pin to top
ko: 상단에 고정
ru: Закрепить вверху
zh_hans: 置顶
zh_hant: 置頂

source: Pinned
ko: 고정됨
ru: Закреплено
zh_hans: 已固定
zh_hant: 已固定

source: Pinned fact disabled.
ko: 고정된 사실을 사용하지 않습니다.
ru: Закрепленный факт отключен.
zh_hans: 已禁用固定事实。
zh_hant: 已禁用固定事實。

source: Pinned fact forgotten.
ko: 고정된 사실을 잊었습니다.
ru: Закрепленный факт забыт.
zh_hans: 已遗忘固定事实。
zh_hant: 已固定事實被遺忘。

source: Pinned fact was not found.
ko: 고정된 사실을 찾을 수 없습니다.
ru: Закрепленный факт не найден.
zh_hans: 未找到固定事实。
zh_hant: 未找到固定事實。

# Pinned fact: %@. Salience %lld percent
source: Pinned fact: %1$@. Salience %2$lld percent
ko: 고정된 사실: %1$@. 중요도 %2$lld퍼센트
ru: Закрепленный факт: %1$@. Выраженность %2$lld процента
zh_hans: 置顶事实：%1$@。显著度 %2$lld 百分点
zh_hant: 置頂事實：%1$@。顯著度 %2$lld 百分點

source: Pinned facts
ko: 고정된 사실
ru: Закрепленные факты
zh_hans: 固定事实
zh_hant: 固定事實

source: Pinned Facts
ko: 고정된 사실
ru: Закрепленные факты
zh_hans: 固定事实
zh_hant: 固定事實

source: PINNED FACTS
ko: 고정된 사실
ru: ЗАКРЕПЛЁННЫЕ ФАКТЫ
zh_hans: 固定事实
zh_hant: 固定事實

source: Pinned to an open-source release and checksum-verified before every launch.
ko: 오픈 소스 릴리스에 고정되며 실행할 때마다 체크섬으로 검증됩니다.
ru: Привязан к открытому релизу и проверяется по контрольной сумме перед каждым запуском.
zh_hans: 锁定到某个开源发布版本，并在每次启动前进行校验和验证。
zh_hant: 鎖定至某個開源發行版本，並在每次啟動前進行核對和驗證。

source: Pipeline
ko: 파이프라인
ru: Трубопровод
zh_hans: 管道
zh_hant: 管道

source: Pipeline healthy.
ko: 파이프라인이 정상입니다.
ru: Трубопровод здоров.
zh_hans: 管道正常
zh_hant: 管道正常

source: Place the task-progress notch overlay on the menu bar. When off, it sits just below the menu bar so it never covers the clock, battery, or other system status controls.
ko: 작업 진행 상황 노치 오버레이를 메뉴 막대에 배치합니다. 끄면 메뉴 막대 바로 아래에 표시되어 시계, 배터리 또는 기타 시스템 상태 항목을 가리지 않습니다.
ru: Размещает оверлей выреза с ходом выполнения задачи в строке меню. Когда выключено, он располагается прямо под строкой меню и не закрывает часы, батарею и другие элементы состояния системы.
zh_hans: 将任务进度刘海浮层放置在菜单栏上。关闭时，它位于菜单栏正下方，因此绝不会遮挡时钟、电池或其他系统状态控件。
zh_hant: 將任務進度瀏海浮層放置在選單列上。關閉時，它位於選單列正下方，因此絕不會遮擋時鐘、電池或其他系統狀態控制項。

source: Placeholder
ko: 자리 표시자
ru: Заполнитель
zh_hans: 占位符
zh_hant: 佔位符

source: Placeholder label (optional)
ko: 자리 표시자 레이블 (선택 사항)
ru: Ярлык-заполнитель (необязательно)
zh_hans: 占位符标签（可选）
zh_hant: 佔位符標籤（可選）

source: Plain
ko: 일반
ru: Простой
zh_hans: 纯文本
zh_hant: 純文本

source: Plaintext by default — opt in to SQLCipher at-rest encryption
ko: 기본값은 일반 텍스트입니다 — SQLCipher 저장 데이터 암호화를 사용 설정하세요
ru: По умолчанию открытый текст — включите шифрование SQLCipher при хранении.
zh_hans: 默认明文 — 选择启用 SQLCipher 静态加密
zh_hant: 默認明文 — 選擇啓用SQLCipher靜態加密

source: Planned
ko: 예정됨
ru: Планируется
zh_hans: 计划中
zh_hant: 計劃中

source: Planned Batching Controls
ko: 예정된 일괄 처리 제어
ru: Планируемое управление пакетированием
zh_hans: 计划中的批处理控制
zh_hant: 計劃批處理控制

source: Planned Cache Controls
ko: 예정된 캐시 제어
ru: Планируемые элементы управления кэшем
zh_hans: 计划中的缓存控制
zh_hant: 計劃中的緩存控制

source: Planned Controls
ko: 예정된 제어
ru: Плановые меры контроля
zh_hans: 计划中的控制
zh_hant: 計劃控制

source: Platform
ko: 플랫폼
ru: Платформа
zh_hans: 平台
zh_hant: 平臺

source: Play
ko: 재생
ru: Играть
zh_hans: 播放
zh_hant: 播放

source: Please fill in all required fields
ko: 모든 필수 필드를 작성해 주세요
ru: Пожалуйста, заполните все обязательные поля
zh_hans: 请填写所有必填字段
zh_hant: 請填寫所有必填字段

source: Please translate the following to Spanish:
ko: 다음을 스페인어로 번역해 주세요:
ru: Пожалуйста, переведите следующее на испанский:
zh_hans: 请将以下内容翻译成西班牙语：
zh_hant: 請將以下內容翻譯成西班牙語：

source: Please try again.
ko: 다시 시도해 주세요.
ru: Попробуйте ещё раз.
zh_hans: 请重试。
zh_hant: 請重試。

source: Plug in a brain you already pay for, or run one locally with Ollama.
ko: 이미 비용을 지불하고 있는 두뇌를 연결하거나 Ollama를 사용하여 로컬에서 실행하세요.
ru: Подключите модель, за которую уже платите, или запустите локальную через Ollama.
zh_hans: 接入一个你已经付费的大脑，或使用 Ollama 在本地运行一个。
zh_hant: 接入一個你已經付費的大腦，或使用 Ollama 在本地運行一個。

source: plugin
ko: 플러그인
ru: плагин
zh_hans: 插件
zh_hant: 插件

source: Plugin
ko: 플러그인
ru: Плагин
zh_hans: 插件
zh_hant: 插件

source: Plugin Creation
ko: 플러그인 생성
ru: Создание плагина
zh_hans: 插件创建
zh_hant: 插件創建

source: Plugin Creator
ko: 플러그인 생성기
ru: Создатель плагинов
zh_hans: 插件创建者
zh_hant: 插件創建者

source: Plugin failed to load
ko: 플러그인을 불러오지 못했습니다
ru: Плагин не удалось загрузить
zh_hans: 插件加载失败
zh_hant: 插件加載失敗

source: Plugin id
ko: 플러그인 ID
ru: Идентификатор плагина
zh_hans: 插件 ID
zh_hant: 插件 ID

source: Plugin Name
ko: 플러그인 이름
ru: Имя плагина
zh_hans: 插件名称
zh_hant: 插件名稱

source: Plugin Runtime
ko: 플러그인 런타임
ru: Время выполнения плагина
zh_hans: 插件运行时
zh_hant: 插件運行時

source: Plugin Tools
ko: 플러그인 도구
ru: Инструменты плагина
zh_hans: 插件工具
zh_hant: 插件工具

source: Plugin updates available
ko: 플러그인 업데이트 가능
ru: Доступны обновления плагина
zh_hans: 有可用插件更新
zh_hant: 有可用插件更新

source: Plugin verification failed
ko: 플러그인 확인 실패
ru: Проверка плагина не удалась
zh_hans: 插件验证失败
zh_hant: 插件驗證失敗

source: Plugins
ko: 플러그인
ru: Плагины
zh_hans: 插件
zh_hant: 插件

source: Plugins can now browse and update reliably without hitting GitHub's limit.
ko: 이제 GitHub의 한도에 걸리지 않고 플러그인을 안정적으로 탐색하고 업데이트할 수 있습니다.
ru: Теперь плагины можно надёжно просматривать и обновлять, не достигая лимита GitHub.
zh_hans: 现在可以稳定地浏览和更新插件，不会触及 GitHub 的限制。
zh_hant: 現在可以穩定地瀏覽和更新插件程式，不會觸及 GitHub 的限制。

source: Plugins disabled after repeated crashes. Run "osaurus tools reset" in Terminal to recover.
ko: 반복적인 충돌로 인해 플러그인이 사용 안 함으로 설정되었습니다. 복구하려면 터미널에서 "osaurus tools reset"을 실행하세요.
ru: Плагины отключены после неоднократных сбоев. Запустите «osaurus сброс инструментов» в Терминале для восстановления.
zh_hans: 插件因反复崩溃已被禁用。请在终端运行“osaurus tools reset”进行恢复。
zh_hant: 插件因反覆崩潰已被禁用。請在終端運行「osaurus tools reset」進行恢復。

source: PNG encoding failed.
ko: PNG 인코딩에 실패했습니다.
ru: PNG кодирование не выполнено.
zh_hans: PNG 编码失败。
zh_hant: PNG 編碼失敗。

source: PocketTTS Model
ko: PocketTTS 모델
ru: Модель PocketTTS
zh_hans: PocketTTS 模型
zh_hant: PocketTTS 模型

source: Point Osaurus at a folder of guides, templates, and standards and grant it to agents so they can consult it on demand. Markdown, plain text, code, PDF, Word, Excel, PowerPoint, and CSV files are supported.
ko: 가이드, 템플릿, 표준이 담긴 폴더를 Osaurus에 지정하고 에이전트에 허용하면 필요할 때 참조할 수 있습니다. 마크다운, 일반 텍스트, 코드, PDF, Word, Excel, PowerPoint, CSV 파일을 지원합니다.
ru: Укажите Osaurus папку с руководствами, шаблонами и стандартами и предоставьте её агентам, чтобы они могли обращаться к ней по мере необходимости. Поддерживаются Markdown, обычный текст, код, PDF, Word, Excel, PowerPoint и CSV.
zh_hans: 让 Osaurus 指向一个包含指南、模板、规范的文件夹，并授权给智能体，让它们可以按需查阅。支持 Markdown、纯文本、代码、PDF、Word、Excel、PowerPoint 和 CSV 文件。
zh_hant: 讓 Osaurus 指向一個包含指南、範本、規範的資料夾，並授權給代理，讓它們可以按需查閱。支援 Markdown、純文字、程式碼、PDF、Word、Excel、PowerPoint 和 CSV 檔案。

source: Point Osaurus at folders of reference material like team guides, standards, specs, and spreadsheets, and your agents can search and read them on demand. Markdown, plain text, code, PDF, Word, Excel, PowerPoint, and CSV files are all indexed, entirely on your Mac.
ko: 팀 가이드, 표준, 사양, 스프레드시트 같은 참고 자료 폴더를 Osaurus에 지정하면 에이전트가 필요할 때 검색하고 읽을 수 있습니다. 마크다운, 일반 텍스트, 코드, PDF, Word, Excel, PowerPoint, CSV 파일이 모두 색인되며, 전부 Mac에서 처리됩니다.
ru: Укажите Osaurus папки со справочными материалами, такими как командные руководства, стандарты, спецификации и таблицы, и ваши агенты смогут искать и читать их по запросу. Файлы Markdown, обычный текст, код, PDF, Word, Excel, PowerPoint и CSV индексируются полностью на вашем Mac.
zh_hans: 将 Osaurus 指向包含团队指南、标准、规范和表格等参考资料的文件夹，你的智能体即可按需搜索和阅读。Markdown、纯文本、代码、PDF、Word、Excel、PowerPoint 和 CSV 文件都会被索引，完全在你的 Mac 上进行。
zh_hant: 將 Osaurus 指向包含團隊指南、標準、規格和表格等參考資料的資料夾，您的智能體即可按需搜尋和閱讀。Markdown、純文字、程式碼、PDF、Word、Excel、PowerPoint 和 CSV 檔案都會被索引，完全在您的 Mac 上進行。

source: Poll Interval Seconds
ko: 폴링 간격(초)
ru: Интервал опроса (секунды)
zh_hans: 轮询间隔（秒）

source: Poll task status and activity
ko: 작업 상태 및 활동 폴링
ru: Опрос статуса и активности задачи
zh_hans: 轮询任务状态和活动
zh_hant: 輪詢任務狀態和活動

source: Polls
ko: 설문
ru: Опросы
zh_hans: 投票

source: Port, network exposure, CORS, top-P, model eviction, and idle residency now live in Server → Settings, backed by the vmlx server-runtime contract.
ko: 포트, 네트워크 노출, CORS, top-P, 모델 축출 및 유휴 상주 시간은 이제 vmlx server-runtime 계약이 지원하는 서버 → 설정에 있습니다.
ru: Порт, доступ к сети, CORS, top-P, вытеснение модели и место простоя теперь находятся в разделе Сервер → Настройки, подкрепленные контрактом времени выполнения сервера vmlx.
zh_hans: 端口、网络暴露、CORS、top-P、模型逐出和空闲驻留现在位于“服务端 → 设置”中，由 vmlx 服务端运行时契约提供支持。
zh_hant: 端口、網絡暴露、CORS、top-P、模型逐出和空閒駐留現在位於“服務器 → 設置”中，由 vmlx 服務器運行時契約提供支持。

source: Post into a specific thread instead of the room itself.
ko: 룸 자체가 아닌 특정 스레드에 게시합니다.
ru: Публиковать в конкретный тред, а не в саму комнату.
zh_hans: 发布到特定线程，而不是房间本身。
zh_hant: 發佈到特定討論串，而不是房間本身。

source: Posting not allowed
ko: 게시가 허용되지 않음
ru: Публикация не разрешена
zh_hans: 不允许发帖
zh_hant: 不允許發文

source: Posting won't work until these are fixed. You can still save now.
ko: 이 문제를 해결하기 전에는 게시가 작동하지 않습니다. 지금 저장할 수는 있습니다.
ru: Публикация не заработает, пока это не исправлено. Сохранить можно уже сейчас.
zh_hans: 在修复这些问题之前无法发帖。你现在仍可以保存。
zh_hant: 在修復這些問題之前無法發文。您現在仍可以儲存。

source: Posts agents want to send, plus what already went out
ko: 에이전트가 보내려는 게시물과 이미 보낸 게시물
ru: Посты, которые агенты хотят отправить, и то, что уже ушло
zh_hans: 智能体想要发送的帖子，以及已发出的内容
zh_hant: 智能體想要傳送的貼文，以及已發出的內容

source: Posts that need your OK before sending appear here.
ko: 전송 전에 승인이 필요한 게시물이 여기에 표시됩니다.
ru: Здесь появляются посты, которым нужно ваше подтверждение перед отправкой.
zh_hans: 需要你批准后才能发送的帖子会显示在这里。
zh_hant: 需要您核准後才能傳送的貼文會顯示在這裡。

source: Posts your agents want to send. You always see the exact message and destination before anything goes out, and every safety check runs again at send time.
ko: 에이전트가 보내려는 게시물입니다. 무엇이든 나가기 전에 항상 정확한 메시지와 대상을 확인할 수 있으며, 전송 시점에 모든 안전 검사가 다시 실행됩니다.
ru: Посты, которые хотят отправить ваши агенты. Вы всегда видите точное сообщение и назначение до отправки, а при отправке все проверки безопасности выполняются заново.
zh_hans: 你的智能体想要发送的帖子。任何内容发出前，你都能看到确切的消息和目标，并且发送时会再次运行所有安全检查。
zh_hant: 您的智能體想要傳送的貼文。任何內容發出前，您都能看到確切的訊息和目標，並且傳送時會再次執行所有安全檢查。

source: Power & Sleep
ko: 전원 및 잠자기
ru: Питание и сон
zh_hans: 电源与睡眠
zh_hant: 電源與睡眠

source: Powered by FluidAudio PocketTTS. English only. Streams audio as it's synthesized.
ko: FluidAudio PocketTTS로 구동됩니다. 영어만 지원합니다. 합성되는 대로 오디오를 스트리밍합니다.
ru: На базе FluidAudio PocketTTS. Только английский. Звук воспроизводится по мере синтеза.
zh_hans: 由 FluidAudio PocketTTS 提供支持。仅支持英语。在合成的同时流式播放音频。
zh_hant: 由 FluidAudio PocketTTS 提供支持。僅支持英語。在合成的同時流式播放音頻。

source: Pre-flight picks the most relevant per turn.
ko: 사전 검사는 턴마다 가장 관련성이 높은 것을 선택합니다.
ru: Предполетная подготовка выбирает самое актуальное за ход.
zh_hans: 预检会在每一轮挑选最相关的项目。
zh_hant: 預檢會在每一輪挑選最相關的項目。

source: Pre-registered OAuth client id (leave blank for DCR)
ko: 사전 등록된 OAuth Client ID (DCR의 경우 비워 둠)
ru: Предварительно зарегистрированный идентификатор клиента OAuth (оставьте пустым для DCR)
zh_hans: 预注册的 OAuth Client ID（留空以使用 DCR）
zh_hant: 預註冊的 OAuth Client ID（留空以使用DCR）

source: Pre-upgrade pairing — grants access to all agents and never expires. Revoke and re-pair to scope it to a single agent.
ko: 업그레이드 전 페어링 — 모든 에이전트에 대한 액세스 권한을 부여하며 만료되지 않습니다. 단일 에이전트로 범위를 지정하려면 권한을 취소하고 다시 페어링하세요.
ru: Сопряжение перед обновлением — предоставляет доступ ко всем агентам и не имеет срока действия. Отмените и повторно подключите его, чтобы ограничить его одним агентом.
zh_hans: 升级前的配对——授予对所有智能体的访问权限且永不过期。撤销并重新配对可将其限定到单个智能体。
zh_hant: 升級前的配對——授予對所有智能體的訪問權限且永不過期。撤銷並重新配對可將其限定到單個智能體。
